# NOTE: As of Homebrew changes, some taps (homebrew/bundle, homebrew/cask-fonts)
# are deprecated. Keep this Brewfile minimal and prefer core formulas/casks.

# -- CLI Tools (brew formulas) --
brew "git"
brew "gemini-cli"
brew "node"
brew "python"
brew "zsh-autosuggestions"
brew "tree"
brew "jq" # Great for processing JSON
brew "xcodes"
brew "duti" # set default handlers (e.g., default browser)
brew "mas" # Mac App Store CLI (use `mas install <id>` for store apps)

# -- GUI Apps (casks)
cask "visual-studio-code"
cask "iterm2"
cask "slack"
cask "docker"
cask "firefox"
cask "bitwarden"
cask "rectangle" # Window management

# -- Fonts (via homebrew/cask-fonts)
cask "font-fira-code" # Nice dev font

# Notes:
# - Group entries by type (taps / brew / cask / mas) so `brew bundle` stays readable.
# - Remove duplicates and comment optional items. Add mas-managed app IDs separately.
